InformationRegisters/ДатыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДатыСогласования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСогласованияАрхитектором</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСогласованияДизайнером</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСогласованияЗаказчиком</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументИзменения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СогласованиеКомплектовЗаказчиком</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДатыСогласования/Ext/ManagerModule.bsl
Процедура ЗаписатьДатуСогласования(Комплект, ДатаСогласованияАрхитектором = Неопределено) Экспорт

    МенеджерЗаписи = РегистрыСведений.ДатыСогласования.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Комплект = Комплект;
	
	МенеджерЗаписи.Прочитать();
	
	Если НЕ МенеджерЗаписи.Выбран() Тогда
		МенеджерЗаписи.Комплект = Комплект;
	КонецЕсли;      
	
	МенеджерЗаписи.ДатаСогласованияДизайнером = ТекущаяДата();
	
	Если НЕ ДатаСогласованияАрхитектором = Неопределено Тогда
		МенеджерЗаписи.ДатаСогласованияАрхитектором = ДатаСогласованияАрхитектором;
	КонецЕсли;
	
	МенеджерЗаписи.Записать()
	
КонецПроцедуры
